
ymaps.ready(init);

function init() {
  const myMap = new ymaps.Map('map', {
    center: [55.745508, 37.435225],
    zoom: 13,
  });

  // Добавим на карту схему проезда
  // от улицы Крылатские холмы до станции метро "Кунцевская"
  // через станцию "Молодежная" и затем до станции "Пионерская".
  // Точки маршрута можно задавать 3 способами:
  // как строка, как объект или как массив геокоординат.
  ymaps.route([
    'Москва, улица Крылатские холмы',
    {
      point: 'Москва, метро Молодежная',
      // метро "Молодежная" - транзитная точка
      // (проезжать через эту точку, но не останавливаться в ней).
      type: 'viaPoint',
    },
    [55.731272, 37.447198], // метро "Кунцевская".
    'Москва, метро Пионерская',
  ]).then((route) => {
    myMap.geoObjects.add(route);
    // Зададим содержание иконок начальной и конечной точкам маршрута.
    // С помощью метода getWayPoints() получаем массив точек маршрута.
    // Массив транзитных точек маршрута можно получить с помощью метода getViaPoints.
    const points = route.getWayPoints();
    const lastPoint = points.getLength() - 1;
    // Задаем стиль метки - иконки будут красного цвета, и
    // их изображения будут растягиваться под контент.
    points.options.set('preset', 'twirl#redStretchyIcon');
    // Задаем контент меток в начальной и конечной точках.
    points.get(0).properties.set('iconContent', 'Точка отправления');
    points.get(lastPoint).properties.set('iconContent', 'Точка прибытия');

    // Проанализируем маршрут по сегментам.
    // Сегмент - участок маршрута, который нужно проехать до следующего
    // изменения направления движения.
    // Для того, чтобы получить сегменты маршрута, сначала необходимо получить
    // отдельно каждый путь маршрута.
    // Весь маршрут делится на два пути:
    // 1) от улицы Крылатские холмы до станции "Кунцевская";
    // 2) от станции "Кунцевская" до "Пионерская".


  }
